; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 854990 2 3 2 6 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	infrared0 - mode
	spectrograph1 - mode
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	GroundStation0 - direction
	Star4 - direction
	GroundStation1 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 spectrograph1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
	(supports instrument2 infrared0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon7)
)
(:goal (and
	(pointing satellite0 Star9)
	(have_image Planet6 spectrograph1)
	(have_image Phenomenon7 infrared0)
	(have_image Planet8 infrared0)
	(have_image Star9 spectrograph1)
	(have_image Star10 spectrograph1)
	(have_image Planet11 infrared0)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 7
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 7
3. (turn_to satellite0 star4 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star4)
   goals met: 0 of 7
4. (turn_to satellite1 star10 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 star10)
   goals met: 0 of 7
5. (calibrate satellite0 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 0 of 7
6. (turn_to satellite1 planet8 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 planet8)
   goals met: 0 of 7
7. (turn_to satellite0 star9 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star9)
   goals met: 1 of 7
8. (turn_to satellite1 groundstation1 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 groundstation1)
   goals met: 1 of 7
9. (take_image satellite0 star9 instrument1 spectrograph1)
   added: (have_image star9 spectrograph1)
   goals met: 2 of 7
10. (calibrate satellite1 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 2 of 7
11. (turn_to satellite0 star10 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star10)
   goals met: 1 of 7
12. (turn_to satellite1 planet8 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet8)
   goals met: 1 of 7
13. (take_image satellite0 star10 instrument1 spectrograph1)
   added: (have_image star10 spectrograph1)
   goals met: 2 of 7
14. (take_image satellite1 planet8 instrument2 infrared0)
   added: (have_image planet8 infrared0)
   goals met: 3 of 7
15. (turn_to satellite0 star9 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star9)
   goals met: 4 of 7
16. (turn_to satellite1 planet6 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet6)
   goals met: 4 of 7
17. (take_image satellite1 planet6 instrument2 spectrograph1)
   added: (have_image planet6 spectrograph1)
   goals met: 5 of 7
18. (turn_to satellite0 planet11 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 planet11)
   goals met: 4 of 7
19. (turn_to satellite1 phenomenon7 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 phenomenon7)
   goals met: 4 of 7
20. (take_image satellite0 planet11 instrument1 infrared0)
   added: (have_image planet11 infrared0)
   goals met: 5 of 7
21. (turn_to satellite0 star9 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star9)
   goals met: 6 of 7
22. (take_image satellite1 phenomenon7 instrument2 infrared0)
   added: (have_image phenomenon7 infrared0)
   goals met: 7 of 7
